DataProcessors/ПомощникСверкиРазметкиАУСНСДаннымиФНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникСверкиРазметкиАУСНСДаннымиФНС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/РазметкаАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РазметкаАУСН</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиРазметкиАУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакНалоговойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиНалоговойБазыАУСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииОперацийАУСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ПомощникСверкиРазметкиАУСНСДаннымиФНС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Справочники.Организации.ИспользуетсяНесколькоОрганизаций() Тогда
		Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Иначе
		Фильтр = Новый Структура;
		Фильтр.Вставить("ТолькоАУСН", Истина);
		ДоступныеОрганизации = Справочники.Организации.ПолучитьДанныеВыбора(Новый Структура("Отбор", Фильтр));
		Если ДоступныеОрганизации.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Отсутствуют организации, применяющие АУСН'");
			Отказ = Истина;
		ИначеЕсли ДоступныеОрганизации.Количество() = 1 Тогда
			Элементы.Организация.СписокВыбора.Добавить(ДоступныеОрганизации[0].Значение);
			Организация = ДоступныеОрганизации[0].Значение;
			Элементы.Организация.ТолькоПросмотр = Истина;
		Иначе
			Для Каждого ДоступнаяОрганизация Из ДоступныеОрганизации Цикл
				Элементы.Организация.СписокВыбора.Добавить(ДоступнаяОрганизация.Значение);
			КонецЦикла;
			ПереданнаяОрганизация = Параметры.Организация;
			Если ЗначениеЗаполнено(ПереданнаяОрганизация)
				И ДоступныеОрганизации.НайтиПоЗначению(ПереданнаяОрганизация) <> Неопределено Тогда
				Организация = ПереданнаяОрганизация;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИнструкцияПоВыгрузкеРазметки" Тогда
		СтандартнаяОбработка = Ложь;
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://its.1c.ru/bmk/ausn_sverka");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьФорму" И (ТипЗнч(Источник) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет")
		Или ТипЗнч(Источник) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета")) Тогда
		Отбор = Новый Структура("БанковскаяОперация", Источник);
		НайденныеСтроки = ДанныеСверки.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбновитьФорму(Источник);
			УправлениеФормой();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзменениеВыписки" Тогда
		ПроверитьУдаленныеБанковскиеОперации();
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена организация'"));
		Возврат;
	КонецЕсли;
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Фильтр = НСтр("ru = 'Файл с выгрузкой разметки *.xlsx, *.csv|*.xlsx;*.csv'");
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог = Проводник;
	
	ФайловаяСистемаКлиент.ЗагрузитьФайлы(ОповещениеВыбора, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцияИсправлениеРасхожденийСсылкаНажатие(Элемент)
	
	ПараметрыОткрываемойФормы = Новый Структура;
	ПараметрыОткрываемойФормы.Вставить("Банки", Банки);
	ПараметрыОткрываемойФормы.Вставить("Организация", ОтборОрганизация);
	ОткрытьФорму(
		"Обработка.ПомощникСверкиРазметкиАУСНСДаннымиФНС.Форма.ИнструкцияРазрешениеРасхождений",
		ПараметрыОткрываемойФормы,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтображенияОперацийПриИзменении(Элемент)
	
	УстановитьОтборСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДанныеСверки) И ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СменаОрганизацииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'Данные сверки будут очищены. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеСверки

&НаКлиенте
Процедура ДанныеСверкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "ДанныеСверкиБанковскаяОперация" Тогда
		Операция = Элемент.ТекущиеДанные.БанковскаяОперация;
		Если ТипЗнч(Операция) <> Тип("Строка") Тогда
			ПоказатьЗначение( , Операция);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СменаОрганизацииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ПутьКФайлу);
	ПодготовитьФормуИВыполнитьСверку(АдресХраненияФайла, Расширение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗагрузки = Новый Структура("ВыбранныйФайл", ВыбранныеФайлы[0]);
	Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьЗагрузку", ЭтотОбъект, ПараметрыЗагрузки);
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'Данные сверки будут очищены. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ПродолжитьЗагрузку(Неопределено, ПараметрыЗагрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузку(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Файл = ДополнительныеПараметры.ВыбранныйФайл;
	ПутьКФайлу = Файл.Имя;
	АдресХраненияФайла = Файл.Хранение;
	Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(Файл.ИмяФайла);
	ПодготовитьФормуИВыполнитьСверку(Файл.Хранение, Расширение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФормуИВыполнитьСверку(АдресХранения, Расширение)
	
	ОтборОрганизация = Организация;
	ДанныеСверки.Очистить();
	ТекстОшибки = "";
	Банки = Неопределено;
	СостояниеФормы = СостоянияФормы().ИдетЗагрузка;
	УправлениеФормой();
	Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ПутьКФайлу);
	ВыполнитьСверкуНаСервере(АдресХранения, Расширение);
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСверкуНаСервере(АдресХранилища, РасширениеФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныеДанные.Записать(ИмяФайла);
	
	Если РасширениеФайла = "csv" Тогда
		Чтение = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
		СтрокаЗаголовков = Чтение.ПрочитатьСтроку();
		Заголовки = СтрРазделить(СтрокаЗаголовков, ";");
		ЗагруженныеДанные = Новый ТаблицаЗначений;
		Для Каждого ЗаголовокКолонки Из Заголовки Цикл
			РезультатПоиска = СтрНайтиПоРегулярномуВыражению(
				ЗаголовокКолонки, "^[^А-Яа-я]*([А-Яа-я]+(?:\s+[А-Яа-я]+)*)");
			НайденныеЗаголовки = РезультатПоиска.ПолучитьГруппы();
			Если НайденныеЗаголовки.Количество() = 0 Тогда
				ОбработатьОшибочнуюСитуацию(НСтр("ru = 'Не найдены заголовки при чтении файла с расширением ""csv""'"));
				УдалитьВременныйФайл(ИмяФайла);
				Возврат;
			КонецЕсли;
			ОбработанныйЗаголовок = НайденныеЗаголовки[0].Значение;
			ЗагруженныеДанные.Колонки.Добавить(
				СтрЗаменить(ОбработанныйЗаголовок, " ", ""), ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаНазначенияПлатежа()));
		КонецЦикла;
		Текст = Чтение.Прочитать();
		Чтение.Закрыть();
		
		ПрочитанныеЗначения = ОбщегоНазначенияБПКлиентСервер.РазобратьТекстВФорматеЗначенийСРазделителями(
			Текст, ";");
		МаксимальныйИндексКолонки = ЗагруженныеДанные.Колонки.Количество() - 1;
		Для Каждого ЧастиСтроки Из ПрочитанныеЗначения Цикл
			ПорцияДанных = ЗагруженныеДанные.Добавить();
			Для Индекс = 0 По ЧастиСтроки.ВГраница() Цикл
				Если Индекс <= МаксимальныйИндексКолонки Тогда
					ПорцияДанных[Индекс] = ЧастиСтроки[Индекс];
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		ДанныеРазметки = Новый ТабличныйДокумент;
		ДанныеРазметки.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеРазметки.Область());
		Построитель.ЗаполнитьНастройки();
		Построитель.Выполнить();
		Если Не Построитель.ИсточникДанных.Колонки.Количество() > 0
			Или Построитель.Результат.Пустой() Тогда
			ОбработатьОшибочнуюСитуацию(
				НСтр("ru = 'Не найдены данные при чтении файла с расширением ""xlsx""'"));
			УдалитьВременныйФайл(ИмяФайла);
			Возврат;
		КонецЕсли;
		ЗагруженныеДанные = Построитель.Результат.Выгрузить();
	КонецЕсли;
	
	УдалитьВременныйФайл(ИмяФайла);
	
	Для Каждого Колонка Из ЗагруженныеДанные.Колонки Цикл
		Если СтрНайти(Колонка.Имя, "РазметкаОперации") > 0 Тогда
			Колонка.Имя = "РазметкаОперации";
		ИначеЕсли СтрНайти(Колонка.Имя, "Дата") > 0 Тогда
			Колонка.Имя = "ДатаСтрокой";
		КонецЕсли;
	КонецЦикла;
	
	Если Не СтруктураЗагруженныхДанныхВалидна(ЗагруженныеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиБанковскихОпераций = ЗагруженныеДанные.НайтиСтроки(Новый Структура("Источник", "Банковская операция"));
	БанковскиеОперации = ЗагруженныеДанные.Скопировать(СтрокиБанковскихОпераций, "ДатаСтрокой, Операция, РазметкаОперации");
	Если Не ЗначениеЗаполнено(БанковскиеОперации) Тогда
		СостояниеФормы = СостоянияФормы().СверкаУспешноЗавершена;
		Возврат;
	КонецЕсли;
	ЗагруженныеДанные = Неопределено;
	
	БанковскиеОперации.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	БанковскиеОперации.Колонки.Добавить(
		"ПризнакНалоговойБазыФНС", Новый ОписаниеТипов("ПеречислениеСсылка.ПризнакиНалоговойБазыАУСН"));
	БанковскиеОперации.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ОграничениеТипаЧисло = БанковскиеОперации.Колонки.Сумма.ТипЗначения;
	
	// Если разметка состоит из нескольких строк, то вторая и последующие строки создают записи в отдельной таблице
	ДополнительныеСтроки = БанковскиеОперации.СкопироватьКолонки("Дата, Сумма, ПризнакНалоговойБазыФНС, Операция");
	
	КэшПризнаковНалоговойБазы = Новый Соответствие;
	Для Каждого Запись Из БанковскиеОперации Цикл
		Если ТипЗнч(Запись.ДатаСтрокой) = Тип("Дата") Тогда
			Запись.Дата = Запись.ДатаСтрокой;
		Иначе
			Запись.Дата = СтроковыеФункцииКлиентСервер.СтрокаВДату(Запись.ДатаСтрокой);
		КонецЕсли;
		ДанныеРазметки = СтрНайтиВсеПоРегулярномуВыражению(Запись.РазметкаОперации, "([А-Яа-я\s]+)=\s*(\d+(?:[.,]\d{1,2})?)");
		ПервоеЗначение = Истина;
		Для Каждого Разметка Из ДанныеРазметки Цикл
			Если ПервоеЗначение Тогда
				ТекущаяСтрока = Запись;
			Иначе
				ТекущаяСтрока = ДополнительныеСтроки.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Запись);
			КонецЕсли;
			ПервоеЗначение = Ложь;
			ЧастиРазметки = Разметка.ПолучитьГруппы();
			ПризнакНалоговойБазыФНС = СтрЗаменить(ЧастиРазметки[0].Значение, " ", "");
			НайденныйПризнак = КэшПризнаковНалоговойБазы.Получить(ПризнакНалоговойБазыФНС);
			Если НайденныйПризнак = Неопределено Тогда
				НайденныйПризнак = ОбщегоНазначенияБП.НайтиЗначениеПеречисления(
					"ПризнакиНалоговойБазыАУСН", ПризнакНалоговойБазыФНС);
				КэшПризнаковНалоговойБазы.Вставить(ПризнакНалоговойБазыФНС, НайденныйПризнак);
			КонецЕсли;
			ТекущаяСтрока.ПризнакНалоговойБазыФНС = НайденныйПризнак;
			ПрочитаннаяСумма = ЧастиРазметки[1].Значение;
			ТекущаяСтрока.Сумма = ОграничениеТипаЧисло.ПривестиЗначение(ПрочитаннаяСумма);
		КонецЦикла;
	КонецЦикла;
	БанковскиеОперации.Колонки.Удалить("ДатаСтрокой");
	БанковскиеОперации.Колонки.Удалить("РазметкаОперации");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеСтроки, БанковскиеОперации);
	ДополнительныеСтроки = Неопределено;
	БанковскиеОперации.Сортировать("Дата");
	НачалоПериода = НачалоМесяца(БанковскиеОперации[0].Дата);
	ВерхняяГраница = БанковскиеОперации.Количество() - 1;
	КонецПериода = КонецМесяца(БанковскиеОперации[ВерхняяГраница].Дата);
	
	БанковскиеОперации.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(4));
	БанковскиеОперации.ЗаполнитьЗначения(1, "Количество");
	БанковскиеОперации.Свернуть("Дата, Операция, ПризнакНалоговойБазыФНС, Сумма", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_БанковскиеОперации.Дата КАК Дата,
		|	ВТ_БанковскиеОперации.Операция КАК Операция,
		|	ВТ_БанковскиеОперации.ПризнакНалоговойБазыФНС КАК ПризнакНалоговойБазыФНС,
		|	ВТ_БанковскиеОперации.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТ_БанковскиеОперации
		|ИЗ
		|	&ЗагруженныеБанковскиеОперации КАК ВТ_БанковскиеОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(ПоступлениеНаРасчетныйСчет.Дата, ДЕНЬ) КАК Дата,
		|	ПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК НазначениеПлатежа
		|ПОМЕСТИТЬ ВТ_ДокументыПрограммы
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
		|ГДЕ
		|	ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеНаРасчетныйСчет.Проведен
		|	И ПоступлениеНаРасчетныйСчет.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.Ссылка,
		|	НАЧАЛОПЕРИОДА(СписаниеСРасчетногоСчета.Дата, ДЕНЬ),
		|	СписаниеСРасчетногоСчета.НазначениеПлатежа
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|ГДЕ
		|	СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СписаниеСРасчетногоСчета.Проведен
		|	И СписаниеСРасчетногоСчета.Организация = &Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазметкаАУСНОбороты.БанковскаяОперация КАК БанковскаяОперация,
		|	РазметкаАУСНОбороты.ПризнакНалоговойБазы КАК ПризнакНалоговойБазы,
		|	РазметкаАУСНОбороты.СуммаОборот КАК Сумма,
		|	ВТ_ДокументыПрограммы.Дата КАК Дата,
		|	ВТ_ДокументыПрограммы.НазначениеПлатежа КАК НазначениеПлатежа
		|ПОМЕСТИТЬ ВТ_Разметка
		|ИЗ
		|	РегистрНакопления.РазметкаАУСН.Обороты(
		|			,
		|			,
		|			,
		|			БанковскаяОперация В
		|				(ВЫБРАТЬ
		|					ВТ_ДокументыПрограммы.Ссылка КАК Ссылка
		|				ИЗ
		|					ВТ_ДокументыПрограммы КАК ВТ_ДокументыПрограммы)) КАК РазметкаАУСНОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыПрограммы КАК ВТ_ДокументыПрограммы
		|		ПО РазметкаАУСНОбороты.БанковскаяОперация = ВТ_ДокументыПрограммы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДокументыПрограммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_БанковскиеОперации.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаФНС,
		|	ЕСТЬNULL(ВТ_БанковскиеОперации.Операция, """") КАК ОперацияФНС,
		|	ЕСТЬNULL(ВТ_БанковскиеОперации.ПризнакНалоговойБазыФНС, ЗНАЧЕНИЕ(Перечисление.ПризнакиНалоговойБазыАУСН.ПустаяСсылка)) КАК ПризнакНалоговойБазыФНС,
		|	ЕСТЬNULL(ВТ_БанковскиеОперации.Сумма, 0) КАК СуммаФНС,
		|	ВТ_Разметка.БанковскаяОперация КАК БанковскаяОперация,
		|	ВТ_Разметка.ПризнакНалоговойБазы КАК ПризнакНалоговойБазы1С,
		|	ВТ_Разметка.Сумма КАК Сумма1С,
		|	ВТ_Разметка.Дата КАК Дата1С,
		|	ВТ_Разметка.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ВЫБОР
		|		КОГДА ВТ_БанковскиеОперации.Операция ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ВТ_БанковскиеОперации.Операция = ВТ_Разметка.НазначениеПлатежа
		|				И ВТ_БанковскиеОперации.ПризнакНалоговойБазыФНС = ВТ_Разметка.ПризнакНалоговойБазы
		|			ТОГДА 3
		|		КОГДА ВТ_Разметка.НазначениеПлатежа = ВТ_БанковскиеОперации.Операция
		|			ТОГДА 2
		|		КОГДА ВТ_БанковскиеОперации.ПризнакНалоговойБазыФНС = ВТ_Разметка.ПризнакНалоговойБазы
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет,
		|	ВТ_Разметка.БанковскаяОперация.СчетОрганизации.Банк КАК Банк,
		|	ВЫБОР
		|		КОГДА ВТ_БанковскиеОперации.Операция ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ВТ_БанковскиеОперации.Операция = ВТ_Разметка.НазначениеПлатежа
		|				И ВТ_БанковскиеОперации.ПризнакНалоговойБазыФНС = ВТ_Разметка.ПризнакНалоговойБазы
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПриоритетПолногоСовпадения,
		|	ВЫБОР
		|		КОГДА ВТ_БанковскиеОперации.Операция ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ВТ_Разметка.НазначениеПлатежа = ВТ_БанковскиеОперации.Операция
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПриоритетСовпаденияНазначенияПлатежа
		|ИЗ
		|	ВТ_БанковскиеОперации КАК ВТ_БанковскиеОперации
		|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_Разметка КАК ВТ_Разметка
		|		ПО ВТ_БанковскиеОперации.Дата = ВТ_Разметка.Дата
		|			И ВТ_БанковскиеОперации.Сумма = ВТ_Разметка.Сумма
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетПолногоСовпадения УБЫВ,
		|	ПриоритетСовпаденияНазначенияПлатежа УБЫВ,
		|	Приоритет УБЫВ
		|ИТОГИ
		|	МИНИМУМ(Сумма1С),
		|	МИНИМУМ(Дата1С),
		|	МАКСИМУМ(Приоритет),
		|	МАКСИМУМ(Банк),
		|	СУММА(ПриоритетПолногоСовпадения),
		|	СУММА(ПриоритетСовпаденияНазначенияПлатежа)
		|ПО
		|	БанковскаяОперация,
		|	ПризнакНалоговойБазы1С";
	
	Запрос.УстановитьПараметр("ЗагруженныеБанковскиеОперации", БанковскиеОперации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	БанкиСОбнаруженнымиКоллизиями = Новый Массив;
	ДокументыБезСоответствия = НовыйДокументыБезСоответствия();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() Цикл
		ВыборкаПризнакНалоговойБазы = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПризнакНалоговойБазы.Следующий() Цикл
			СоответствиеНайдено = Ложь;
			Выборка = ВыборкаПризнакНалоговойБазы.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Не ЗначениеЗаполнено(Выборка.ДатаФНС) Тогда
					Прервать;
				КонецЕсли;
				Фильтр = Новый Структура;
				Фильтр.Вставить("Дата", Выборка.ДатаФНС);
				Фильтр.Вставить("Сумма", Выборка.СуммаФНС);
				Фильтр.Вставить("Операция", Выборка.ОперацияФНС);
				НайденныеОперации = БанковскиеОперации.НайтиСтроки(Фильтр);
				Если ЗначениеЗаполнено(НайденныеОперации) Тогда
					// Если даже документу нашлось соответствие в операциях ФНС, не факт, что соответствие будет установлено,
					// возможно операцию уже сопоставили с другим документом
					Отбор = Новый Структура;
					Отбор.Вставить("Документ", ВыборкаДокумент.БанковскаяОперация);
					Отбор.Вставить("Признак", ВыборкаПризнакНалоговойБазы.ПризнакНалоговойБазы1С);
					НайденныеБезСоответствия = ДокументыБезСоответствия.НайтиСтроки(Отбор);
					Для Каждого УдаляемаяСтрока Из НайденныеБезСоответствия Цикл
						ДокументыБезСоответствия.Удалить(УдаляемаяСтрока);
					КонецЦикла;
					НайденнаяОперация = НайденныеОперации[0];
					НайденнаяОперация.Количество = НайденнаяОперация.Количество - 1;
					Если НайденнаяОперация.Количество = 0 Тогда
						БанковскиеОперации.Удалить(НайденнаяОперация);
					КонецЕсли;
					ДобавитьСтроку(Выборка);
					СоответствиеНайдено = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не СоответствиеНайдено Тогда
				ДобавляемаяСтрока = ДокументыБезСоответствия.Добавить();
				ДобавляемаяСтрока.Документ = ВыборкаДокумент.БанковскаяОперация;
				ДобавляемаяСтрока.Признак = ВыборкаПризнакНалоговойБазы.ПризнакНалоговойБазы1С;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОпределеныБанкиСРасхождениями = Не ЗначениеЗаполнено(БанковскиеОперации);
	
	Для Каждого Строка Из ДокументыБезСоответствия Цикл
		ВыборкаДокумент.Сбросить();
		ВыборкаДокумент.НайтиСледующий(Строка.Документ, "БанковскаяОперация");
		ВыборкаПризнак = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаПризнак.НайтиСледующий(Строка.Признак, "ПризнакНалоговойБазы1С");
		ДобавитьСтроку(ВыборкаПризнак, Ложь);
		Если ОпределеныБанкиСРасхождениями И БанкиСОбнаруженнымиКоллизиями.Найти(ВыборкаПризнак.Банк) = Неопределено Тогда
			БанкиСОбнаруженнымиКоллизиями.Добавить(ВыборкаПризнак.Банк);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаОперации Из БанковскиеОперации Цикл
		Пока СтрокаОперации.Количество > 0 Цикл
			ДобавитьСтрокуПоОперацииБезСоответствия(СтрокаОперации);
			СтрокаОперации.Количество = СтрокаОперации.Количество - 1;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьВариантОтображенияДанныхСверки();
	
	Если ОпределеныБанкиСРасхождениями Тогда
		Банки = Новый СписокЗначений;
		Для Каждого Ссылка Из БанкиСОбнаруженнымиКоллизиями Цикл
			Банки.Добавить(Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеСверки.Сортировать("Дата Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	ВсеСостояния = СостоянияФормы();
	
	Если СостояниеФормы = ВсеСостояния.ИдетЗагрузка Тогда
		Элементы.ГруппаШапка.Видимость = Ложь;
		Элементы.ГруппаОжидание.Видимость = Истина;
		Элементы.ГруппаБаннерКоллизии.Видимость = Ложь;
		Элементы.ДанныеСверки.Видимость = Ложь;
		Элементы.ГруппаБаннерУспешнаяСверка.Видимость = Ложь;
	ИначеЕсли СостояниеФормы = ВсеСостояния.ВыполненоСРасхождениями
		Или СостояниеФормы = ВсеСостояния.СверкаУспешноЗавершена Тогда
		Элементы.ГруппаШапка.Видимость = Истина;
		Элементы.ГруппаЗаголовки.Видимость = Ложь;
		Элементы.ГруппаОжидание.Видимость = Ложь;
		Элементы.ГруппаБаннерКоллизии.Видимость = СостояниеФормы = ВсеСостояния.ВыполненоСРасхождениями;
		Элементы.ДанныеСверки.Видимость = Истина;
		Элементы.ГруппаБаннерУспешнаяСверка.Видимость = СостояниеФормы = ВсеСостояния.СверкаУспешноЗавершена;
		Элементы.ТекстОшибки.Видимость = Ложь;
	Иначе
		Элементы.ГруппаШапка.Видимость = Истина;
		Элементы.ГруппаЗаголовки.Видимость = Истина;
		Элементы.ГруппаОжидание.Видимость = Ложь;
		Элементы.ГруппаБаннерКоллизии.Видимость = Ложь;
		Элементы.ДанныеСверки.Видимость = Ложь;
		Элементы.ГруппаБаннерУспешнаяСверка.Видимость = Ложь;
		Элементы.ТекстОшибки.Видимость = ЗначениеЗаполнено(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтроку(Выборка, ЗаполнятьПоляФНС = Истина)
	
	НоваяСтрока = ДанныеСверки.Добавить();
	НоваяСтрока.Дата = Выборка.Дата1С;
	НоваяСтрока.Сумма = Выборка.Сумма1С;
	НоваяСтрока.БанковскаяОперация = Выборка.БанковскаяОперация;
	НоваяСтрока.НадписьПоДаннымПрограммы = НСтр("ru = 'По данным программы'");
	НоваяСтрока.НадписьПоДаннымФНС = НСтр("ru = 'По данным ФНС'");
	НоваяСтрока.ПризнакНалоговойБазы1С = ?(
		Не ЗначениеЗаполнено(Выборка.ПризнакНалоговойБазы1С),
		ЗначениеОперацияНеНайдена(),
		Выборка.ПризнакНалоговойБазы1С);
	НоваяСтрока.ПризнакНалоговойБазыФНС = ?(
		Не ЗаполнятьПоляФНС Или Не ЗначениеЗаполнено(Выборка.ПризнакНалоговойБазыФНС),
		ЗначениеОперацияНеНайдена(),
		Выборка.ПризнакНалоговойБазыФНС);
	Если ЗаполнятьПоляФНС Тогда
		НоваяСтрока.ОперацияФНС = Выборка.ОперацияФНС;
		НоваяСтрока.ЕстьРасхождение = НоваяСтрока.ПризнакНалоговойБазы1С <> НоваяСтрока.ПризнакНалоговойБазыФНС;
	Иначе
		НоваяСтрока.ЕстьРасхождение = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПоОперацииБезСоответствия(СтрокаОперации)
	
	НоваяСтрока = ДанныеСверки.Добавить();
	НоваяСтрока.Дата = СтрокаОперации.Дата;
	НоваяСтрока.Сумма = СтрокаОперации.Сумма;
	НоваяСтрока.НадписьПоДаннымПрограммы = НСтр("ru = 'По данным программы'");
	НоваяСтрока.НадписьПоДаннымФНС = НСтр("ru = 'По данным ФНС'");
	НоваяСтрока.БанковскаяОперация = ЗначениеОперацияНеНайдена();
	НоваяСтрока.ПризнакНалоговойБазыФНС = СтрокаОперации.ПризнакНалоговойБазыФНС;
	НоваяСтрока.ПризнакНалоговойБазы1С = ЗначениеОперацияНеНайдена();
	НоваяСтрока.ОперацияФНС = СтрокаОперации.Операция;
	НоваяСтрока.ЕстьРасхождение = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеОперацияНеНайдена()
	
	Возврат НСтр("ru = 'Операция не найдена'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрок(Форма)
	
	Если Форма.ВариантОтображенияОпераций = "Все" Тогда
		Форма.Элементы.ДанныеСверки.ОтборСтрок = Неопределено;
	Иначе
		Форма.Элементы.ДанныеСверки.ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьРасхождение", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Условное оформление признака налоговой базы по данным программы, если операции ФНС не найдено соответствия
	ОформлениеПризнакаНалоговойБазы1С = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(
		ОформлениеПризнакаНалоговойБазы1С.Поля, "ДанныеСверкиПризнакНалоговойБазы1С");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ОформлениеПризнакаНалоговойБазы1С.Отбор,
		"ДанныеСверки.ПризнакНалоговойБазы1С",
		ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеОперацияНеНайдена(),
		,
		Истина);
	ОформлениеПризнакаНалоговойБазы1С.Оформление.УстановитьЗначениеПараметра(
		"ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	ОформлениеПризнакаНалоговойБазы1С.Использование = Истина;
	
	// Условное оформление признака налоговой базы по данным ФНС, если он не соотвествует признаку по данным программы
	ОформлениеПризнакаНалоговойБазыФНС = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(
		ОформлениеПризнакаНалоговойБазыФНС.Поля, "ДанныеСверкиПризнакНалоговойБазыФНС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ОформлениеПризнакаНалоговойБазыФНС.Отбор,
		"ДанныеСверки.ПризнакНалоговойБазыФНС",
		ВидСравненияКомпоновкиДанных.НеРавно,
		Новый ПолеКомпоновкиДанных("ДанныеСверки.ПризнакНалоговойБазы1С"),
		,
		Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ОформлениеПризнакаНалоговойБазыФНС.Отбор,
		"ДанныеСверки.ПризнакНалоговойБазы1С",
		ВидСравненияКомпоновкиДанных.НеРавно,
		ЗначениеОперацияНеНайдена(),
		,
		Истина);
	ОформлениеПризнакаНалоговойБазыФНС.Оформление.УстановитьЗначениеПараметра(
		"ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	ОформлениеПризнакаНалоговойБазыФНС.Использование = Истина;
	
	// Условное оформление банковской операции, если для операций по данным ФНС не нашлось
	// соответствия в банковских документах программы
	ОформлениеБанковскойОперации = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(
		ОформлениеБанковскойОперации.Поля, "ДанныеСверкиБанковскаяОперация");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ОформлениеБанковскойОперации.Отбор,
		"ДанныеСверки.БанковскаяОперация",
		ВидСравненияКомпоновкиДанных.Равно,
		ЗначениеОперацияНеНайдена(),
		,
		Истина);
	ОформлениеБанковскойОперации.Оформление.УстановитьЗначениеПараметра(
		"ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	ОформлениеБанковскойОперации.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОшибочнуюСитуацию(ОписаниеОшибки)
	
	СостояниеФормы = СостоянияФормы().ОжидаетсяВыборФайла;
	ТекстОшибки = ОписаниеОшибки;
	ЗаписьЖурналаРегистрации(
		СверкаРазметкиАУСНКлиентСервер.ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Обработки.ПомощникСверкиРазметкиАУСНСДаннымиФНС,
		,
		ОписаниеОшибки);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлинаНазначенияПлатежа()
	
	МетаданныеПоступления = Метаданные.Документы.ПоступлениеНаРасчетныйСчет;
	МетаданныеНазначенияПлатежа = МетаданныеПоступления.Реквизиты.НазначениеПлатежа;
	Возврат МетаданныеНазначенияПлатежа.Тип.КвалификаторыСтроки.Длина;
	
КонецФункции

&НаСервере
Функция СтруктураЗагруженныхДанныхВалидна(ЗагруженныеДанные)
	
	НеобходимыеКолонки = НеобходимыйСоставКолонок();
	НеНайденныеКолонки = Новый Массив;
	Для Каждого Элемент Из НеобходимыеКолонки Цикл
		Если ЗагруженныеДанные.Колонки.Найти(Элемент.Ключ) = Неопределено Тогда
			НеНайденныеКолонки.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ШаблонСообщенияОбОшибке = "";
	Если НеНайденныеКолонки.Количество() = 1 Тогда
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Некорректная структура файла, ожидается колонка %1'");
	ИначеЕсли НеНайденныеКолонки.Количество() > 1 Тогда
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Некорректная структура файла, ожидаются колонки: %1'");
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	ОбработатьОшибочнуюСитуацию(
		СтрШаблон(ШаблонСообщенияОбОшибке, СтрСоединить(НеНайденныеКолонки, ", ")));
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НеобходимыйСоставКолонок()
	
	ИменаКолонок = Новый Структура;
	ИменаКолонок.Вставить("ДатаСтрокой", "Дата");
	ИменаКолонок.Вставить("Операция", "Операция");
	ИменаКолонок.Вставить("РазметкаОперации", "Разметка операции");
	ИменаКолонок.Вставить("Источник", "Источник");
	
	Возврат ИменаКолонок;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СостоянияФормы()
	
	ВсеСостояния = Новый Структура;
	ВсеСостояния.Вставить("ОжидаетсяВыборФайла", "ОжидаетсяВыборФайла");
	ВсеСостояния.Вставить("ИдетЗагрузка", "ИдетЗагрузка");
	ВсеСостояния.Вставить("ВыполненоСРасхождениями", "ВыполненоСРасхождениями");
	ВсеСостояния.Вставить("СверкаУспешноЗавершена", "СверкаУспешноЗавершена");
	
	Возврат ВсеСостояния;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьВременныйФайл(ИмяФайла)
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		ЗаписьЖурналаРегистрации(
			СверкаРазметкиАУСНКлиентСервер.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйДокументыБезСоответствия()
	
	Результат = Новый ТаблицаЗначений;
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет"));
	Результат.Колонки.Добавить("Документ", Новый ОписаниеТипов(ТипыДокументов));
	Результат.Колонки.Добавить("Признак", Новый ОписаниеТипов("ПеречислениеСсылка.ПризнакиНалоговойБазыАУСН"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьФорму(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазметкаАУСНОбороты.БанковскаяОперация КАК БанковскаяОперация,
		|	РазметкаАУСНОбороты.ПризнакНалоговойБазы КАК ПризнакНалоговойБазы1С,
		|	РазметкаАУСНОбороты.СуммаОборот КАК Сумма1С,
		|	НАЧАЛОПЕРИОДА(РазметкаАУСНОбороты.БанковскаяОперация.Дата, ДЕНЬ) КАК Дата1С
		|ИЗ
		|	РегистрНакопления.РазметкаАУСН.Обороты(, , , БанковскаяОперация = &БанковскаяОперация) КАК РазметкаАУСНОбороты";
	
	Запрос.УстановитьПараметр("БанковскаяОперация", Документ);
	
	Разметка = Запрос.Выполнить().Выгрузить();
	Отбор = Новый Структура("БанковскаяОперация", Документ);
	СтрокиТаблицыФормы = ДанныеСверки.НайтиСтроки(Отбор);
	
	ВыполнитьСопоставлениеСтрок(Разметка, СтрокиТаблицыФормы);
	ВыполнитьСопоставлениеСтрок(Разметка, СтрокиТаблицыФормы, Ложь);
	
	Если ЗначениеЗаполнено(Разметка) Тогда
		Отбор.БанковскаяОперация = ЗначениеОперацияНеНайдена();
		Отбор.Вставить("Дата", Разметка[0].Дата1С);
		СтрокиСНезаполненнымДокументом = ДанныеСверки.НайтиСтроки(Отбор);
		ВыполнитьСопоставлениеСтрок(Разметка, СтрокиСНезаполненнымДокументом);
		ВыполнитьСопоставлениеСтрок(Разметка, СтрокиСНезаполненнымДокументом, Ложь);
	КонецЕсли;
	
	Для Каждого СтрокаРазметки Из Разметка Цикл
		ДобавитьСтроку(СтрокаРазметки, Ложь);
	КонецЦикла;
	
	Для Каждого СтрокаФормы Из СтрокиТаблицыФормы Цикл
		Если СтрокаФормы.ПризнакНалоговойБазыФНС <> ЗначениеОперацияНеНайдена() Тогда
			СтрокаФормы.БанковскаяОперация = ЗначениеОперацияНеНайдена();
			СтрокаФормы.ПризнакНалоговойБазы1С = ЗначениеОперацияНеНайдена();
			СтрокаФормы.ЕстьРасхождение = Истина;
		Иначе
			ДанныеСверки.Удалить(СтрокаФормы);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьВариантОтображенияДанныхСверки();
	ДанныеСверки.Сортировать("Дата Убыв");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСопоставлениеСтрок(Разметка, СтрокиТаблицыФормы, ТолькоПолноеСоответствие = Истина)
	
	СоответствиеСтрок = Новый Соответствие;
	
	Для Каждого СтрокаРазметки Из Разметка Цикл
		Для Каждого СтрокаФормы Из СтрокиТаблицыФормы Цикл
			Если СоответствиеСтрок.Получить(СтрокаФормы) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаФормы.Сумма = СтрокаРазметки.Сумма1С И СтрокаФормы.Дата = СтрокаРазметки.Дата1С Тогда
				Если ТолькоПолноеСоответствие
					И СтрокаФормы.ПризнакНалоговойБазыФНС <> СтрокаРазметки.ПризнакНалоговойБазы1С Тогда
					Продолжить;
				Иначе
					СоответствиеСтрок.Вставить(СтрокаФормы, СтрокаРазметки);
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Элемент Из СоответствиеСтрок Цикл
		СтрокаФормы = Элемент.Ключ;
		СтрокаРазметки = Элемент.Значение;
		СтрокаФормы.Дата = СтрокаРазметки.Дата1С;
		СтрокаФормы.БанковскаяОперация = СтрокаРазметки.БанковскаяОперация;
		СтрокаФормы.ПризнакНалоговойБазы1С = СтрокаРазметки.ПризнакНалоговойБазы1С;
		СтрокаФормы.ЕстьРасхождение = СтрокаФормы.ПризнакНалоговойБазы1С <> СтрокаФормы.ПризнакНалоговойБазыФНС;
		Разметка.Удалить(СтрокаРазметки);
		Индекс = СтрокиТаблицыФормы.Найти(СтрокаФормы);
		СтрокиТаблицыФормы.Удалить(Индекс);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьУдаленныеБанковскиеОперации()
	
	ДокументыСверки = ДанныеСверки.Выгрузить( , "БанковскаяОперация");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|ГДЕ
		|	НЕ СписаниеСРасчетногоСчета.Проведен
		|	И СписаниеСРасчетногоСчета.Ссылка В(&Документы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеНаРасчетныйСчет.Ссылка
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
		|ГДЕ
		|	НЕ ПоступлениеНаРасчетныйСчет.Проведен
		|	И ПоступлениеНаРасчетныйСчет.Ссылка В(&Документы)";
	
	Запрос.УстановитьПараметр("Документы", ДокументыСверки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("БанковскаяОперация", Выборка.Ссылка);
		НайденныеСтроки = ДанныеСверки.НайтиСтроки(Отбор);
		Для Каждого Строка Из НайденныеСтроки Цикл
			Если Строка.ПризнакНалоговойБазыФНС = ЗначениеОперацияНеНайдена() Тогда
				ДанныеСверки.Удалить(Строка);
			Иначе
				Строка.БанковскаяОперация = ЗначениеОперацияНеНайдена();
				Строка.ПризнакНалоговойБазы1С = ЗначениеОперацияНеНайдена();
				Строка.ЕстьРасхождение = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьВариантОтображенияДанныхСверки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОтображенияДанныхСверки()
	
	СтрокиСРасхождениями = ДанныеСверки.НайтиСтроки(Новый Структура("ЕстьРасхождение", Истина));
	Если СтрокиСРасхождениями.Количество() > 0 Тогда
		ВариантОтображенияОпераций = "Расхождения";
		СостояниеФормы = СостоянияФормы().ВыполненоСРасхождениями;
	Иначе
		ВариантОтображенияОпераций = "Все";
		СостояниеФормы = СостоянияФормы().СверкаУспешноЗавершена;
	КонецЕсли;
	
	УстановитьОтборСтрок(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
